text = "Я дружу з Павлушею Завгороднім. Ми живемо в одному селі — Васюківка. Павлуша — мій найкращий друг. Він дуже сміливий. Якось він упіймав щура голими руками. А ще Павлуша придумав стати тореадором. Він хотів тренуватися просто на корові Ганнусі. Але вона як рвонула через город — мало не знесла тин! Ми тоді ледве втекли."

# title() — робить першу літеру кожного слова великою
title_text = text.title()
print("Текст з великої кожного слова:")
print(title_text)

# endswith() — перевіряє, чи закінчується текст на певну фразу
ends = text.endswith("втекли.")
print(f"\nЧи закінчується текст на слово 'втекли.': {ends}")

# 3. replace() — замінює слово "Павлуша" на "друг"
replaced_text = text.replace("Павлуша", "друг")
print("\nТекст після заміни 'Павлуша' на 'друг':")
print(replaced_text)